IDEA StatiCa Open Model
ConnectionData.Welds Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Welds of the connection
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<WeldData> Welds { get; set; }
Public Property Welds As List(Of WeldData)
	Get
	Set
public:
property List<WeldData^>^ Welds {
	List<WeldData^>^ get ();
	void set (List<WeldData^>^ value);
}
Property Value
Type: List<WeldData>
See Also
Reference
ConnectionData Class
IdeaRS.OpenModel.Connection Namespace